#include <stdio.h> // นำเข้าฟังก์ชันมาตรฐาน เช่น printf() และ scanf()

int main() {
    int n; // ประกาศตัวแปร n เพื่อเก็บจำนวนที่ผู้ใช้กรอก

    printf("Enter number : "); // แสดงข้อความให้ผู้ใช้กรอกค่า
    scanf("%d", &n); // รับค่าจำนวนเต็มจากผู้ใช้แล้วเก็บในตัวแปร n

    // วนลูปจาก n ลงมา 2
    for (int i = n; i >= 2; i--) {
        int isPrime = 1; // สมมติว่า i เป็นจำนวนเฉพาะก่อน (flag = 1)

        // ตรวจสอบตัวหารของ i ตั้งแต่ 2 ถึง i/2
        for (int j = 2; j <= i / 2; j++) {
            if (i % j == 0) { // ถ้า i หาร j ลงตัว
                isPrime = 0; // แสดงว่าไม่ใช่จำนวนเฉพาะ
                break; // ออกจาก loop ตัวตรวจสอบตัวหารทันที
            }
        }

        if (isPrime) { // ถ้า isPrime ยังเป็น 1 แสดงว่า i เป็นจำนวนเฉพาะ
            printf("%d ", i); // แสดง i และเว้นวรรค
        }
    }

    return 0; // ส่งค่า 0 กลับให้ระบบปฏิบัติการ = โปรแกรมทำงานสำเร็จ
}
