#include <stdio.h> // นำเข้าฟังก์ชันมาตรฐาน เช่น printf() และ scanf()

int main() {
    int n; // ประกาศตัวแปร n เพื่อเก็บจำนวนที่ผู้ใช้กรอก

    printf("Enter number : "); // แสดงข้อความให้ผู้ใช้กรอกค่า
    scanf("%d", &n); // รับค่าจำนวนเต็มจากผู้ใช้แล้วเก็บในตัวแปร n

    int i = n; // เริ่มตัวนับ i จากค่าที่ผู้ใช้กรอก
    while (i >= 2) { // วนลูปลงมาถึง 2
        int isPrime = 1; // สมมติว่า i เป็นจำนวนเฉพาะก่อน

        int j = 2; // ตัวนับสำหรับตรวจสอบตัวหาร
        while (j <= i / 2) { // ตรวจสอบตัวหารตั้งแต่ 2 ถึง i/2
            if (i % j == 0) { // ถ้า i หาร j ลงตัว
                isPrime = 0; // แสดงว่าไม่ใช่จำนวนเฉพาะ
                break; // ออกจาก loop ตรวจสอบตัวหารทันที
            }
            j++; // เพิ่มตัวนับ j ทีละ 1
        }

        if (isPrime) { // ถ้า i เป็นจำนวนเฉพาะ
            printf("%d ", i); // แสดง i และเว้นวรรค
        }

        i--; // ลดค่า i ลง 1 เพื่อไปตรวจสอบตัวถัดไป
    }

    return 0; // ส่งค่า 0 กลับให้ระบบปฏิบัติการ = โปรแกรมทำงานสำเร็จ
}
